<a href="https://colab.research.google.com/github/zeynepyilmazz/DataScienceBootcamp/blob/main/03.PythonDataScienceLibraries/07.GroupingAndAggregationOperationsOnDataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
info = pd.read_csv("train.csv",index_col=0)

For Pandas assignments, you are going to use [Titanic](https://www.kaggle.com/c/titanic/download/GQf0y8ebHO0C4JXscPPp%2Fversions%2FXkNkvXwqPPVG0Qt3MtQT%2Ffiles%2Ftrain.csv) (train.csv) dataset. Download the dataset and load to a data frame.

**(1)** Calculate the average age of the passengers for each gender and passenger class by using `groupby()` method.

In [2]:
print(info.groupby(by = 'Sex')['Age'].mean())
print(info.groupby(by = 'Pclass')['Age'].mean())
print(info.groupby(by = ['Sex','Pclass'])['Age'].mean())

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64
Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64
Sex     Pclass
female  1         34.611765
        2         28.722973
        3         21.750000
male    1         41.281386
        2         30.740707
        3         26.507589
Name: Age, dtype: float64

**(2)** Group by embarkation port and print values. (Notice that you get unique values with this.)

In [3]:
for group_name , group in info.groupby(by ='Embarked'):
  print(group_name)
  display(group)

C

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
2                   1       1  ...   C85        C
10                  1       2  ...   NaN        C
20                  1       3  ...   NaN        C
27                  0       3  ...   NaN        C
31                  0       1  ...   NaN        C
...               ...     ...  ...   ...      ...
867                 1       2  ...   NaN        C
875                 1       2  ...   NaN        C
876                 1       3  ...   NaN        C
880                 1       1  ...   C50        C
890                 1       1  ...  C148        C

[168 rows x 11 columns]

Q

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
6                   0       3  ...   NaN        Q
17                  0       3  ...   NaN        Q
23                  1       3  ...   NaN        Q
29                  1       3  ...   NaN        Q
33                  1       3  ...   NaN        Q
...               ...     ...  ...   ...      ...
791                 0       3  ...   NaN        Q
826                 0       3  ...   NaN        Q
829                 1       3  ...   NaN        Q
886                 0       3  ...   NaN        Q
891                 0       3  ...   NaN        Q

[77 rows x 11 columns]

S

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
7                   0       1  ...   E46        S
...               ...     ...  ...   ...      ...
884                 0       2  ...   NaN        S
885                 0       3  ...   NaN        S
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S

[644 rows x 11 columns]